{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "text_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "name": "text_in"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, 5], "dtype": "float32", "input_dim": 400001, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 5}, "inbound_nodes": [[["text_in", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "timex_output", "class_name": "Dense", "config": {"name": "timex_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["text_in", 0, 0]], "output_layers": [["timex_output", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of39.bin", "group1-shard2of39.bin", "group1-shard3of39.bin", "group1-shard4of39.bin", "group1-shard5of39.bin", "group1-shard6of39.bin", "group1-shard7of39.bin", "group1-shard8of39.bin", "group1-shard9of39.bin", "group1-shard10of39.bin", "group1-shard11of39.bin", "group1-shard12of39.bin", "group1-shard13of39.bin", "group1-shard14of39.bin", "group1-shard15of39.bin", "group1-shard16of39.bin", "group1-shard17of39.bin", "group1-shard18of39.bin", "group1-shard19of39.bin", "group1-shard20of39.bin", "group1-shard21of39.bin", "group1-shard22of39.bin", "group1-shard23of39.bin", "group1-shard24of39.bin", "group1-shard25of39.bin", "group1-shard26of39.bin", "group1-shard27of39.bin", "group1-shard28of39.bin", "group1-shard29of39.bin", "group1-shard30of39.bin", "group1-shard31of39.bin", "group1-shard32of39.bin", "group1-shard33of39.bin", "group1-shard34of39.bin", "group1-shard35of39.bin", "group1-shard36of39.bin", "group1-shard37of39.bin", "group1-shard38of39.bin", "group1-shard39of39.bin"], "weights": [{"name": "dense_1/kernel", "shape": [25, 3], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [100, 5], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [5], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [400001, 100], "dtype": "float32"}, {"name": "timex_output/kernel", "shape": [3, 1], "dtype": "float32"}, {"name": "timex_output/bias", "shape": [1], "dtype": "float32"}]}]}